# text_or = '【爱上火车静态表情包_认真】【二阶堂真红表情包_别这么说】【二阶堂真红表情包_我有一计】【千恋万花表情包_蕾娜Ciallo】【二阶堂真红表情包_没救了】【二阶堂真红表情包_别这么说】【二阶堂真红表情包_给你一拳】【二阶堂真红表情包_生日快乐】【爱上火车静态表情包_喝茶】【千恋万花表情包_蕾娜Ciallo】【二阶堂真红表情包_该电了】【爱上火车静态表情包_优雅】【二阶堂真红表情包_我真求你了】【千恋万花表情包_zzz】【爱上火车静态表情包_看刀】【千恋万花表情包_zzz】【爱上火车静态表情包_蓑笠凪】【爱上火车静态表情包_右田日日姬】【五彩斑斓的世界_不愧是你】【爱上火车静态表情包_害羞】【五彩斑斓的世界_认命】【二阶堂真红表情包_呜呜呜】【二阶堂真红表情包_没救了】【爱上火车静态表情包_喝茶】【五彩斑斓的世界_欢迎】【爱上火车静态表情包_指挥】【爱上火车静态表情包_奥莉薇】【二阶堂真红表情包_妈妈在呢】【爱上火车静态表情包_玲奈】【二阶堂真红表情包_妈妈】【二阶堂真红表情包_妈妈】【爱上火车静态表情包_二六】【爱上火车静态表情包_雏衣波莱特】【二阶堂真红表情包_讨厌】【五彩斑斓的世界_不愧是你】【二阶堂真红表情包_害羞】【五彩斑斓的世界_大喇叭】【爱上火车静态表情包_看刀】【五彩斑斓的世界_上勾拳】【千恋万花表情包_害羞】【爱上火车静态表情包_认真】【爱上火车静态表情包_指挥】【二阶堂真红表情包_生日快乐】【千恋万花表情包_啊哈哈】【二阶堂真红表情包_该电了】【二阶堂真红表情包_没收】【二阶堂真红表情包_我真求你了】【爱上火车静态表情包_指挥】'
param = {'五彩斑斓的世界_上勾拳': 'A', '五彩斑斓的世界_魔法使': 'B', '五彩斑斓的世界_小憩': 'C', '五彩斑斓的世界_不知廉耻': 'D', '五彩斑斓的世界_不愧是你': 'E', '五彩斑斓的世界_摸头': 'F', '五彩斑斓的世界_祈祷': 'G', '五彩斑斓的世界_喝茶': 'H', '五彩斑斓的世界_老婆': 'I', '五彩斑斓的世界_曙光': 'J', '五彩斑斓的世界_大喇叭': 'K', '五彩斑斓的世界_赞': 'L', '五彩斑斓的世界_比心': 'M', '五彩斑斓的世界_看戏': 'N', '五彩斑斓的世界_哈？': 'O', '五彩斑斓的世界_黑脸': 'P', '五彩斑斓的世界_认命': 'Q', '五彩斑斓的世界_腼腆': 'R', '五彩斑斓的世界_欢迎': 'S', '五彩斑斓的世界_我的钱': 'T', '二阶堂真红表情包_灯塔': 'U', '二阶堂真红表情包_结婚': 'V', '二阶堂真红表情包_永远爱你': 'W', '二阶堂真红表情包_妈妈在呢': 'X', '二阶堂真红表情包_妈妈': 'Y', '二阶堂真红表情包_呜呜呜': 'Z', '二阶堂真红表情包_别这么说': 'a', '二阶堂真红表情包_没救了': 'b', '二阶堂真红表情包_该电了': 'c', '二阶堂真红表情包_生日快乐': 'd', '二阶堂真红表情包_戳': 'e', '二阶堂真红表情包_没收': 'f', '二阶堂真红表情包_喵': 'g', '二阶堂真红表情包_欢迎回家': 'h', '二阶堂真红表情包_给你一拳': 'i', '二阶堂真红表情包_不要看': 'j', '二阶堂真红表情包_害羞': 'k', '二阶堂真红表情包_讨厌': 'l', '二阶堂真红表情包_我真求你了': 'm', '二阶堂真红表情包_我有一计': 'n', '爱上火车静态表情包_优雅': 'o', '爱上火车静态表情包_认真': 'p', '爱上火车静态表情包_收到': 'q', '爱上火车静态表情包_加油': 'r', '爱上火车静态表情包_看刀': 's', '爱上火车静态表情包_害羞': 't', '爱上火车静态表情包_喝茶': 'u', '爱上火车静态表情包_沉思': 'v', '爱上火车静态表情包_指挥': 'w', '爱上火车静态表情包_敬礼': 'x', '爱上火车静态表情包_右田日日姬': 'y', '爱上火车静态表情包_雏衣波莱特': 'z', '爱上火车静态表情包_玲奈': '0', '爱上火车静态表情包_蓑笠凪': '1', '爱上火车静态表情包_早濑深美': '2', '爱上火车静态表情包_右田真暗': '3', '爱上火车静态表情包_宝生稀咲': '4', '爱上火车静态表情包_奥莉薇': '5', '爱上火车静态表情包_二六': '6', '爱上火车静态表情包_西瓜': '7', '千恋万花表情包_芳乃Ciallo': '8', '千恋万花表情包_丛雨Ciallo': '9', '千恋万花表情包_茉子Ciallo': '-', '千恋万花表情包_蕾娜Ciallo': '.', '千恋万花表情包_谢谢': '', '千恋万花表情包_哇~': '~', '千恋万花表情包_诶？！': ':', '千恋万花表情包_zzz': '/', '千恋万花表情包_害羞': '?', '千恋万花表情包_可爱': '#', '千恋万花表情包_哼哼': '', '千恋万花表情包_呆': '', '千恋万花表情包_不愧是我': '@', '千恋万花表情包_心碎': '!', '千恋万花表情包_流汗': '$', '千恋万花表情包_脸红': '&', '千恋万花表情包？？注意键是单引号': "'", '千恋万花表情包_好耶': '(', '千恋万花表情包_ok': ')', '千恋万花表情包_哭哭': '*', '千恋万花表情包_交给我吧': '+', '千恋万花表情包_呃呃': ',', '千恋万花表情包_笨蛋笨蛋': ';', '千恋万花表情包_啊哈哈': '=', '千恋万花表情包_生气': '%'}
# print(param)
def decode(text):
    if '[' in text:
        text_etl = text.split('][')
        text_etl[0] = text_etl[0].replace('[', '')
        text_etl[-1] = text_etl[-1].replace(']', '')
    else:
        text_etl = text.split('】【')
        text_etl[0] = text_etl[0].replace('【', '')
        text_etl[-1] = text_etl[-1].replace('】', '')
    for char in text_etl:
        print(param[char],end='')

if __name__ == '__main__':
    text_or = input('输入密文: ')
    decode(text_or)